benchmarks/results/auth-serialization/test-signup/final/sar-metrics/wrk2/wrk_report.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signup
  2 threads and 4 connections
  Thread calibration: mean lat.: 520.954ms, rate sampling interval: 1298ms
  Thread calibration: mean lat.: 513.013ms, rate sampling interval: 1351ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   521.93ms  119.14ms 712.19ms   55.56%
    Req/Sec     2.14      0.57     3.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  534.53ms
 75.000%  639.49ms
 90.000%  663.55ms
 99.000%  708.61ms
 99.900%  712.70ms
 99.990%  712.70ms
 99.999%  712.70ms
100.000%  712.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     311.807     0.000000            1         1.00
     369.151     0.100000           10         1.11
     399.871     0.200000           20         1.25
     420.351     0.300000           30         1.43
     448.767     0.400000           40         1.67
     534.527     0.500000           50         2.00
     570.367     0.550000           55         2.22
     600.063     0.600000           60         2.50
     618.495     0.650000           66         2.86
     631.295     0.700000           70         3.33
     639.487     0.750000           75         4.00
     642.559     0.775000           77         4.44
     646.143     0.800000           81         5.00
     646.655     0.825000           82         5.71
     650.751     0.850000           85         6.67
     658.431     0.875000           87         8.00
     659.967     0.887500           88         8.89
     666.623     0.900000           91        10.00
     666.623     0.912500           91        11.43
     668.159     0.925000           92        13.33
     677.887     0.937500           93        16.00
     678.911     0.943750           94        17.78
     683.519     0.950000           95        20.00
     683.519     0.956250           95        22.86
     684.543     0.962500           96        26.67
     684.543     0.968750           96        32.00
     688.639     0.971875           97        35.56
     688.639     0.975000           97        40.00
     688.639     0.978125           97        45.71
     708.607     0.981250           98        53.33
     708.607     0.984375           98        64.00
     708.607     0.985938           98        71.11
     708.607     0.987500           98        80.00
     708.607     0.989062           98        91.43
     712.703     0.990625           99       106.67
     712.703     1.000000           99          inf
#[Mean    =      521.934, StdDeviation   =      119.136]
#[Max     =      712.192, Total count    =           99]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  150 requests in 30.02s, 60.17KB read
Requests/sec:      5.00
Transfer/sec:      2.00KB